Update README.md
part2 아키텍처 수정
